INSERT INTO Fire_Regions (region_id, name) VALUES
('FR1', 'Περιφερειακή Πυροσβεστική Διοίκηση Ανατολικής Μακεδονίας και Θράκης'),
('FR2', 'Περιφερειακή Πυροσβεστική Διοίκηση Κεντρικής Μακεδονίας'),
('FR3', 'Περιφερειακή Πυροσβεστική Διοίκηση Δυτικής Μακεδονίας'),
('FR4', 'Περιφερειακή Πυροσβεστική Διοίκηση Ηπείρου'),
('FR5', 'Περιφερειακή Πυροσβεστική Διοίκηση Θεσσαλίας'),
('FR6', 'Περιφερειακή Πυροσβεστική Διοίκηση Ιονίων Νήσων'),
('FR7', 'Περιφερειακή Πυροσβεστική Διοίκηση Δυτικής Ελλάδας'),
('FR8', 'Περιφερειακή Πυροσβεστική Διοίκηση Στερεάς Ελλάδας'),
('FR9', 'Περιφερειακή Πυροσβεστική Διοίκηση Πελοποννήσου'),
('FR10', 'Περιφερειακή Πυροσβεστική Διοίκηση Αττικής'),
('FR11', 'Περιφερειακή Πυροσβεστική Διοίκηση Βορείου Αιγαίου'),
('FR12', 'Περιφερειακή Πυροσβεστική Διοίκηση Νοτίου Αιγαίου'),
('FR13', 'Περιφερειακή Πυροσβεστική Διοίκηση Κρήτης');

INSERT INTO Node_Regions (node_id, region_id) VALUES
('N1', 'FR1'), -- Node 1 under Ανατολικής Μακεδονίας και Θράκης
('N2', 'FR1');

-- Map child nodes to the same region as their parent
INSERT INTO Node_Regions (node_id, region_id) VALUES
('N1_1', 'FR1'),
('N1_2', 'FR1'),
('N1_3', 'FR1'),
('N2_1', 'FR1'),
('N2_2', 'FR1');